apkhot/Precise-delay-of-1us-in-STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define b1_Pin GPIO_PIN_0
#define b1_GPIO_Port GPIOB
#define b2_Pin GPIO_PIN_1
#define b2_GPIO_Port GPIOB
#define b3_Pin GPIO_PIN_2
#define b3_GPIO_Port GPIOB
#define b11_Pin GPIO_PIN_10
#define b11_GPIO_Port GPIOB
#define b12_Pin GPIO_PIN_11
#define b12_GPIO_Port GPIOB
#define b13_Pin GPIO_PIN_12
#define b13_GPIO_Port GPIOB
#define b14_Pin GPIO_PIN_13
#define b14_GPIO_Port GPIOB
#define b15_Pin GPIO_PIN_14
#define b15_GPIO_Port GPIOB
#define b4_Pin GPIO_PIN_3
#define b4_GPIO_Port GPIOB
#define b5_Pin GPIO_PIN_4
#define b5_GPIO_Port GPIOB
#define b6_Pin GPIO_PIN_5
#define b6_GPIO_Port GPIOB
#define b7_Pin GPIO_PIN_6
#define b7_GPIO_Port GPIOB
#define b8_Pin GPIO_PIN_7
#define b8_GPIO_Port GPIOB
#define b9_Pin GPIO_PIN_8
#define b9_GPIO_Port GPIOB
#define b10_Pin GPIO_PIN_9
#define b10_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
